init("0", 0); --以当前应用 Home 键在右边初始化


function tap(x,y)
	x = x + math.random(-5,5)
	y = y + math.random(-5,5)
	touchDown(1, x, y)
	mSleep(50)
	touchUp(1, x, y)
	print(x..","..y)
end
function 点击(x,y)
	x = x + math.random(-10,10)
	y = y + math.random(-10,10)
	touchDown(1, x, y)
	mSleep(50)
	touchUp(1, x, y)
	print(x..","..y)
end

广告={
{{677, 70, 708, 100},"0|0|0x857e64,0|-1|0xe9e5da,0|-2|0xa7a398,-21|-20|0xaca58b,-20|-21|0xfffff6,-20|-22|0x8e8b82",95, 0, 0, 1,a={691,99},延时=200},--百万问答
	{{0, 0, 749, 1333},"0|0|0xfcdd34,6|7|0xf9ad3d,13|12|0xd83a31,95|29|0xc47700,94|30|0xffc848,105|37|0xbba400,103|84|0x6b5152,26|150|0xa70007",95, 0, 0, 1,a={691,99},延时=200},--百万问答
	{{0, 0, 749, 1333},"0|0|0xc43105,37|35|0xcb3f04,2|42|0xb9b89c,4|51|0x7e7c4d,-41|34|0x0f87de,-6|81|0xe7ab2a,-6|107|0x51951e,-52|131|0x6d7005,-72|139|0x1e1a17",95, 0, 0, 1,a={691,99},延时=200},--厨神餐厅
	{{664, 83, 697, 116},"0|0|0x8e4747,0|-1|0xcab8b8,1|-1|0xfdebeb,2|-1|0xb37b7c,-19|-19|0x914545,-18|-19|0xc7b7b8,-18|-20|0xfbebec,-19|-20|0xc17575",95, 0, 0, 1,a={679,100},延时=200},--快手极速版
	{{299, 825, 333, 864},"0|0|0xffd857,0|-1|0xfff683,-6|-1|0xfaf0d6,-6|-2|0xd3c9af,-16|-7|0xd0c9b9,-21|-17|0xe9dab9,-9|-25|0xe1c989",95, 0, 0, 1,a={691,100},延时=200},--王蓝梅的幸福生活
	{{655, 327, 675, 364},"0|0|0xc4c4c6,1|0|0x88888a,2|2|0x181824,2|30|0xd2d3d8,1|30|0xa09fa4,1|29|0x19181d",95, 0, 0, 1,a={691,99},延时=200},--反馈
}

应用={
	{{271, 402, 568, 529},"0|0|0x87d5d7,20|-16|0xd3fbfb,18|-52|0x72d1e3,-12|-81|0xc5fafe,-66|-71|0xc40022,-57|-71|0xd02c53,-118|-82|0xf7a053,-133|-61|0xfeea93,-197|-95|0x913cd6,-213|-101|0x9f35e0",95, 0, 0, 0,a={652,217},延时=200},--阿伟爱消消邀请好友关闭
	{{296, 944, 470, 1037},"0|0|0x9d680a,0|-4|0xc99118,0|-7|0xf4cd35,-1|-11|0xb78120,-13|-27|0x8f8f8f,-12|-34|0xf6d69d,-9|-47|0x77302e,-5|-47|0xe39c9a",95, 0, 0, 0,a={373,980},延时=200},--阿伟爱消消存钱罐领取
	{{265, 345, 506, 674},"0|0|0xa6304b,48|-36|0xac2f37,43|-85|0xc43e34,11|-108|0xffffb5,-5|-133|0xea8873,5|-171|0xce7d4f,10|-185|0xf2c649,3|-194|0xf9eb41",95, 0, 0, 0,a={650,224},延时=200},--阿伟爱消消存钱罐关闭
	{{419, 1205, 549, 1329},"0|0|0x0a0a0a,2|-2|0x001449,7|-13|0x1f8ccf,15|-33|0x050c12,12|-40|0x170e69,13|-44|0x5b5cf5,28|-58|0xef5054",95, 0, 0, 0,a={484,1264},延时=200},--阿伟爱消消幸运抽奖
	{{315, 60, 376, 127},"0|0|0xe73223,-1|0|0xb94842,-1|-2|0x987271,-2|-2|0xfad4d3,-15|-26|0xe8cecf,-14|-30|0xffaca5,-20|-50|0xffffff",95, 0, 0, 0,a={369,732},延时=200},--阿伟爱消消开心收下
	{{228, 12, 379, 135},"0|0|0x9d2024,-7|-13|0xae8784,4|-14|0x613f3e,5|-14|0x942921,7|-15|0xb64942,3|-31|0xa58787,-61|-79|0x060d05",95, 0, 0, 0,a={651,337},延时=200},--阿伟爱消消中弹窗
	
}

打开红包={
	{{192, 189, 315, 295},"0|0|0x55e1f8,9|15|0x6ec8eb,10|21|0x85b0e3,9|28|0x98a5ea,9|40|0x9e76e7,9|48|0x8042e3,27|41|0xa92267,30|17|0xe95f78,41|7|0xf1ae77,43|-13|0xf8e073",95, 0, 0, 0,a={396,1020},延时=200},--阿伟爱消消开始抽奖
	
}

while true do
	for k,v in pairs(广告) do
		x, y = findColor(v[1], v[2], v[3], v[4],v[5],v[6])
		if x > -1 then
			tap(v.a[1],v.a[2])
			if v.延时~=nil then
				mSleep(v.延时)
			end
		end
	end
	mSleep(200)
	
	for k,v in pairs(应用) do
		x, y = findColor(v[1], v[2], v[3], v[4],v[5],v[6])
		if x > -1 then
			点击(v.a[1],v.a[2])
			if v.延时~=nil then
				mSleep(v.延时)
			end
		end
	end
	mSleep(200)
	
	for k,v in pairs(打开红包) do
		x, y = findColor(v[1], v[2], v[3], v[4],v[5],v[6])
		if x > -1 then
			点击(v.a[1],v.a[2])
			if v.延时~=nil then
				mSleep(v.延时)
			end
		end
	end
	mSleep(200)
	
end
